/*задание 1*/
select 	ст.ФИО as ФИО_сотрудника,
		от.Название_отдела
from 	dbdesigner.net.сотрудники ст
     	left join dbdesigner.net.отделы от on ст.отдел=от.id
;

/*задание 2*/
select 	зк.id as Номер_заказа_(id), 
       	ст.ФИО as Имя_сотрудника-продавца, 
       	count(стз.товар) as Количество_товаров_в_заказе,
       	sum (стз.цена_товара) as Общая стоимость заказа
from 	заказы зк
     	join сотрудники ст on зк.сотрудник=ст.id
     	join список_товаров_заказа стз on зк.id=стз.номер_заказа
group by зк.id, ст.ФИО
;

/*задание 3*/
select 	тр.наименование as Наименование_товара, 
        sum (стз.цена_товара) as Общий_доход_от_его_продажи
from 	список_товаров_заказа стз
     	join товары тр on стз.товар=тр.id
group by тр.наименование
order by Общий_доход_от_его_продажи desc
;